In [1]:
import pandas as pd
df = pd.read_csv("Desktop\\empdata.csv")
df

   empid   ename  salary         doj
0   1001  ganesh   10000  10/10/2020
1   1002    anil   20000   3/20/2010
2   1003  gaurav  150000    3/3/2002
3   1004    hema   50000   10/9/2016
4   1005   laxmi   80000   8/10/2010
5   1006   anant   80000    9/9/2010

In [ ]:
#Knowing Rows & Columns

In [2]:
df.shape

(6, 4)

In [5]:
r,c= df.shape

In [6]:
print(r)

6

In [7]:
print(c)

4

In [ ]:
#Retrieving Rows from Data Frame:

In [8]:
df.head()

   empid   ename  salary         doj
0   1001  ganesh   10000  10/10/2020
1   1002    anil   20000   3/20/2010
2   1003  gaurav  150000    3/3/2002
3   1004    hema   50000   10/9/2016
4   1005   laxmi   80000   8/10/2010

In [9]:
df.tail()

   empid   ename  salary        doj
1   1002    anil   20000  3/20/2010
2   1003  gaurav  150000   3/3/2002
3   1004    hema   50000  10/9/2016
4   1005   laxmi   80000  8/10/2010
5   1006   anant   80000   9/9/2010

In [ ]:
#Retrieving a Range of Rows:

In [10]:
df[2:5]

   empid   ename  salary        doj
2   1003  gaurav  150000   3/3/2002
3   1004    hema   50000  10/9/2016
4   1005   laxmi   80000  8/10/2010

In [12]:
df[1::2]

   empid  ename  salary        doj
1   1002   anil   20000  3/20/2010
3   1004   hema   50000  10/9/2016
5   1006  anant   80000   9/9/2010

In [13]:
df[5:0:-1]

   empid   ename  salary        doj
5   1006   anant   80000   9/9/2010
4   1005   laxmi   80000  8/10/2010
3   1004    hema   50000  10/9/2016
2   1003  gaurav  150000   3/3/2002
1   1002    anil   20000  3/20/2010

In [ ]:
 #To Retrieve Column Names & Data

In [15]:
df.columns

Index(['empid', 'ename', 'salary', 'doj'], dtype='object')

In [16]:
df['empid']

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: empid, dtype: int64

In [17]:
df[['empid','ename']]

   empid   ename
0   1001  ganesh
1   1002    anil
2   1003  gaurav
3   1004    hema
4   1005   laxmi
5   1006   anant

In [ ]:
#Finding Maximum & Minimum Values:

In [51]:
df['salary'].max( )

150000.0

In [52]:
df['salary'].max( )

150000.0

In [53]:
#Displaying Statistical Information:

In [29]:
 df . describe( )

             empid       salary
count     6.000000       6.0000
mean   1003.500000   65000.0000
std       1.870829   50892.0426
min    1001.000000   10000.0000
25%    1002.250000   27500.0000
50%    1003.500000   65000.0000
75%    1004.750000   80000.0000
max    1006.000000  150000.0000

In [ ]:
#Knowing the index Range:

In [31]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [28]:
df1= df.set_index('empid')
df1

        ename  salary         doj
empid
1001   ganesh   10000  10/10/2020
1002     anil   20000   3/20/2010
1003   gaurav  150000    3/3/2002
1004     hema   50000   10/9/2016
1005    laxmi   80000   8/10/2010
1006    anant   80000    9/9/2010

In [54]:
#Setting column as index:

In [38]:
df1.set_index("salary", inplace = True)
df1

         ename         doj
salary
10000   ganesh  10/10/2020
20000     anil   3/20/2010
150000  gaurav    3/3/2002
50000     hema   10/9/2016
80000    laxmi   8/10/2010
80000    anant    9/9/2010

In [39]:
df.loc[1004]

ename          hema
salary        50000
doj       10/9/2016
Name: 1004, dtype: object

In [55]:
#Resetting the index

In [56]:
df.reset_index (inplace = True)
df

   index  empid   ename    salary         doj
0      0   1001  ganesh   10000.0  10/10/2020
1      1   1002     NaN       NaN         NaN
2      2   1003  gaurav  150000.0    3/3/2002
3      3   1004    hema   50000.0   10/9/2016
4      4   1005   laxmi   80000.0   8/10/2010
5      5   1006   anant   80000.0    9/9/2010

In [ ]:
#Sorting the Data(ascending,Decending order)

In [46]:
df1 = df.sort_values('index' ,ascending= False)
df1

   index  empid   ename  salary         doj
5      5   1006   anant   80000    9/9/2010
4      4   1005   laxmi   80000   8/10/2010
3      3   1004    hema   50000   10/9/2016
2      2   1003  gaurav  150000    3/3/2002
1      1   1002    anil   20000   3/20/2010
0      0   1001  ganesh   10000  10/10/2020

In [47]:
df1 = df.sort_values('index' ,ascending= True)
df1

   index  empid   ename  salary         doj
0      0   1001  ganesh   10000  10/10/2020
1      1   1002    anil   20000   3/20/2010
2      2   1003  gaurav  150000    3/3/2002
3      3   1004    hema   50000   10/9/2016
4      4   1005   laxmi   80000   8/10/2010
5      5   1006   anant   80000    9/9/2010

In [ ]:
#Handling Missing Data:

In [57]:
df = pd.read_csv("Desktop\\null.csv")
df

   empid   ename    salary         doj
0   1001  ganesh   10000.0  10/10/2020
1   1002     NaN       NaN         NaN
2   1003  gaurav  150000.0    3/3/2002
3   1004    hema   50000.0   10/9/2016
4   1005   laxmi   80000.0   8/10/2010
5   1006   anant   80000.0    9/9/2010

In [58]:
df1 = df.fillna (0) 
df1

   empid   ename    salary         doj
0   1001  ganesh   10000.0  10/10/2020
1   1002       0       0.0           0
2   1003  gaurav  150000.0    3/3/2002
3   1004    hema   50000.0   10/9/2016
4   1005   laxmi   80000.0   8/10/2010
5   1006   anant   80000.0    9/9/2010

In [65]:
#But this is not so useful as it is filling any column with zero( 0).
#So, use this for proper solution.

In [66]:
df1=df.fillna ({ 'ename':'name missing ','salary' : 0.0,'doj': '00-00-00'})
df1

   empid          ename    salary         doj
0   1001         ganesh   10000.0  10/10/2020
1   1002  name missing        0.0    00-00-00
2   1003         gaurav  150000.0    3/3/2002
3   1004           hema   50000.0   10/9/2016
4   1005          laxmi   80000.0   8/10/2010
5   1006          anant   80000.0    9/9/2010

In [67]:
#remove all missing data rows in this table

In [50]:
df.dropna()

   empid   ename    salary         doj
0   1001  ganesh   10000.0  10/10/2020
2   1003  gaurav  150000.0    3/3/2002
3   1004    hema   50000.0   10/9/2016
4   1005   laxmi   80000.0   8/10/2010
5   1006   anant   80000.0    9/9/2010

In [68]:
print("thank you....for watching!")

thank you....for watching!